## pandas

In [1]:
data1 = {
    'a': 1,
    'b': 2,
    'c': 3,
}

In [9]:
data2 = {
    'state': ['ohio', ' ohio', 'nevada', 'nevada'],
    'year': [2000, 2001, 2002, 2001],
    'pop': [1.5, 1.7, 3.6, 2.4]
}

In [4]:
import pandas as pd

In [5]:
frame1 = pd.DataFrame(data1)

ValueError: If using all scalar values, you must pass an index

In [6]:
frame1 = pd.Series(data1)

In [7]:
frame1

a    1
b    2
c    3
dtype: int64

In [10]:
frame2 = pd.DataFrame(data2)

In [11]:
frame2

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2  nevada  2002  3.6
3  nevada  2001  2.4

In [12]:
frame2.head()

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2  nevada  2002  3.6
3  nevada  2001  2.4

In [13]:
pd.DataFrame(data2, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002  nevada  3.6
3  2001  nevada  2.4

In [15]:
frame3 = pd.DataFrame(data2, columns=['year', 'state', 'pop', 'debt'],
                     index=['one', 'two', 'three', 'four', ])

In [16]:
frame3

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002  nevada  3.6  NaN
four   2001  nevada  2.4  NaN

In [17]:
frame3.year

one      2000
two      2001
three    2002
four     2001
Name: year, dtype: int64

In [18]:
frame3.year == frame3['year']

one      True
two      True
three    True
four     True
Name: year, dtype: bool

In [19]:
frame3.loc['three']

year       2002
state    nevada
pop         3.6
debt        NaN
Name: three, dtype: object

In [21]:
frame3.loc[['three', 'one']]

       year   state  pop debt
three  2002  nevada  3.6  NaN
one    2000    ohio  1.5  NaN

In [22]:
frame3 = frame3.state == 'ohio'

In [23]:
frame3

one       True
two      False
three    False
four     False
Name: state, dtype: bool

In [25]:
frame3['eastern'] = frame3.states == 'ohio'

AttributeError: 'Series' object has no attribute 'states'

In [27]:
pop = {
    'nevada': {
        2001: 2.4,
        2002: 2.9
    },
    'ohio': {
        2000: 1.5,
        2001: 1.7,
        2002: 3.6,
    }
}

In [28]:
frame4 = pd.DataFrame(pop)

In [29]:
frame4

      nevada  ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6